In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
dframe1=DataFrame({'key':['X', 'Y', 'Z', 'K'], 'data_set_1':np.arange(4)})

In [7]:
dframe1

  key  data_set_1
0   X           0
1   Y           1
2   Z           2
3   K           3

In [8]:
dframe2=DataFrame({'key':['Q', 'Y', 'Z'], 'data_set_2':[1,2,3]})

In [9]:
dframe2

  key  data_set_2
0   Q           1
1   Y           2
2   Z           3

In [10]:
pd.merge(dframe1,dframe2)

  key  data_set_1  data_set_2
0   Y           1           2
1   Z           2           3

In [11]:
pd.merge(dframe1,dframe2, on='key')

  key  data_set_1  data_set_2
0   Y           1           2
1   Z           2           3

In [12]:
pd.merge(dframe1,dframe2,on='key', how='left')

  key  data_set_1  data_set_2
0   X           0         NaN
1   Y           1         2.0
2   Z           2         3.0
3   K           3         NaN

In [13]:
pd.merge(dframe1,dframe2,on='key',how='right')

  key  data_set_1  data_set_2
0   Q         NaN           1
1   Y         1.0           2
2   Z         2.0           3

In [15]:
pd.merge(dframe1,dframe2,on='key', how='outer')

  key  data_set_1  data_set_2
0   X         0.0         NaN
1   Y         1.0         2.0
2   Z         2.0         3.0
3   K         3.0         NaN
4   Q         NaN         1.0

In [16]:
dframe3=DataFrame({'key':['A', 'X', 'Y', 'Z', 'Q'], 'data_set_3':range(5)})

In [17]:
dframe4=DataFrame({'key':['Y', 'Y', 'X', 'Z'], 'data_set_4':range(4)})

In [18]:
dframe3

  key  data_set_3
0   A           0
1   X           1
2   Y           2
3   Z           3
4   Q           4

In [19]:
dframe4

  key  data_set_4
0   Y           0
1   Y           1
2   X           2
3   Z           3

In [20]:
pd.merge(dframe3,dframe4)

  key  data_set_3  data_set_4
0   X           1           2
1   Y           2           0
2   Y           2           1
3   Z           3           3

In [22]:
df_left=DataFrame({'key1': ['SF', 'SF', 'LA'], 'key2':['one','two','one'], 'left_data':[10,20,30]})

In [24]:
df_right=DataFrame({'key1': ['SF', 'SF', 'LA', 'LA'], 'key2':['one','two','one','two'], 'right_data':[40,50,60,70]})

In [25]:
df_left

  key1 key2  left_data
0   SF  one         10
1   SF  two         20
2   LA  one         30

In [26]:
df_right

  key1 key2  right_data
0   SF  one          40
1   SF  two          50
2   LA  one          60
3   LA  two          70

In [28]:
pd.merge(df_left,df_right,on=['key1','key2'], how='outer')

  key1 key2  left_data  right_data
0   SF  one       10.0          40
1   SF  two       20.0          50
2   LA  one       30.0          60
3   LA  two        NaN          70

In [29]:
pd.merge(df_left,df_right,on='key1')

  key1 key2_x  left_data key2_y  right_data
0   SF    one         10    one          40
1   SF    one         10    two          50
2   SF    two         20    one          40
3   SF    two         20    two          50
4   LA    one         30    one          60
5   LA    one         30    two          70

In [32]:
pd.merge(df_left,df_right,on='key1',suffixes='_lefty', '_righty')

SyntaxError: positional argument follows keyword argument (<ipython-input-32-16b1463c9427>, line 1)